zombie_api/app/controllers/inventories_controller.rb

  def index
    @inventories = Inventory.all
---
SELECT "inventories".* FROM "inventories"

  def create

    @survivor = Survivor.find(params[:survivor_id])
    if(@survivor.infected? == false)
      @inventory = Inventory.create(inventory_params)
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "inventories" ("survivor_id", "name", "water", "food", "medical_kits", "ammo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["survivor_id", 1], ["name", "inventory_0"], ["water", 5], ["food", 1], ["medical_kits", 0], ["ammo", 1], ["created_at", 2016-11-10 17:58:57 UTC], ["updated_at", 2016-11-10 17:58:57 UTC]]