zombie_api/app/controllers/survivors_controller.rb

SELECT "survivors".* FROM "survivors"
---
  def index
    @survivors = Survivor.all

INSERT INTO "survivors" ("name", "age", "gender", "lonlat", "infected?", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "carl"], ["age", 40], ["gender", "M"], ["lonlat", "1000,-1000"], ["infected?", false], ["created_at", 2016-11-10 17:24:49 UTC], ["updated_at", 2016-11-10 17:24:49 UTC]]
---
  def create
    @survivor = Survivor.new(survivor_params)

    if @survivor.save

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def trade ()
    json_hash = JSON.parse(request.raw_post)
    get_trader_id = json_hash['trader_id']

    #get survivor inventory
    @survivor_1 = Survivor.find(params[:id])

UPDATE "inventories" SET "medical_kits" = ?, "updated_at" = ? WHERE "inventories"."id" = ?  [["medical_kits", nil], ["updated_at", 2016-11-11 09:46:36 UTC], ["id", 5]]
---
      trade_2[3] = (inventory_2[3] - items_trade_s_2[3]).abs + items_trade_s_1[3]

      #trade commit
      @survivor_1.inventory.update_attribute(:water, trade_1[0])

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "survivors" SET "infected?" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["infected?", true], ["updated_at", 2016-11-10 18:04:54 UTC], ["id", 1]]
DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 1]]
---
  def flag_infected ()

    flag = JSON.parse(request.raw_post) #infected survivor survivor_flagged.json
    $reported_id = flag['is_infected']
    @reporting_survivor = Survivor.find(params[:id]) # reporting survivor on curl file flag_infected function
    @flagged_survivor = Survivor.find(flag['is_infected'])

    if(flag['is_infected'] == @reporting_survivor.id)
      render json: {"message": "A survivor can't flag himself, that is nonsense!"}, status: 422
    else
      if(@reporting_survivor.infected? == true)
        render json: {"message": "Zombie doesen't flag people!"}, status: 422
      end
      if($reporters.empty?)
        $reporters.push(@reporting_survivor.id)
      else
         if($reporters[0] == @reporting_survivor.id || $reporters[1] == @reporting_survivor.id || $reporters[2] == @reporting_survivor.id)
           render json: {"message": "This survivor already reported!"}, status: 422
         else
           if($reported_id != flag['is_infected'])
             $reporters.clear
             $reporters.push(@reporting_survivor.id)
           else
             $reporters.push(@reporting_survivor.id)
             puts($reporters)
             if($reporters.length == 3)
               $reporters.clear
               @flagged_survivor.update_attribute(:infected?, true)
               @flagged_survivor.inventory.destroy

UPDATE "survivors" SET "lonlat" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["lonlat", "5000,-5000"], ["updated_at", 2016-11-10 17:29:19 UTC], ["id", 1]]
---
  def update
    if @survivor.update(survivor_params)

DELETE FROM "survivors" WHERE "survivors"."id" = ?  [["id", 3]]
---
  def destroy
    @survivor.destroy

SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_survivor
      @survivor = Survivor.find(params[:id])